---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.SetLayoutAsSingle
source: html/95e8c923-7dea-1bb2-e5b9-70974a46485f.htm
---
# Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.SetLayoutAsSingle Method

Sets the Layout Rule property of rebar set to Single.

## Syntax (C#)
```csharp
public void SetLayoutAsSingle()
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - This RebarFreeFormAccessor doesn't contain a valid rebar reference.
 -or-
 This RebarFreeFormAccessor Rebar doesn't contain a valid server GUID.